$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.4',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'ARM',
          'GccVersion' => '10.2.1',
          'Headers' => {
                         '<built-in>' => 1,
                         'FILE.h' => 1,
                         'errno.h' => 1,
                         'expanded-gpio.h' => 1,
                         'fcntl.h' => 1,
                         'gpio.h' => 1,
                         'i2c-dev.h' => 1,
                         'i2c-interface.h' => 1,
                         'i2c.h' => 1,
                         'int-ll64.h' => 1,
                         'ioctl.h' => 1,
                         'plc-peripherals-version.h' => 1,
                         'rpi-gpio.h' => 1,
                         'rpiplc-peripherals.h' => 1,
                         'rpiplc-version.h' => 1,
                         'stddef.h' => 1,
                         'stdint-intn.h' => 1,
                         'stdint-uintn.h' => 1,
                         'stdio.h' => 1,
                         'stdlib.h' => 1,
                         'string.h' => 1,
                         'struct_FILE.h' => 1,
                         'struct_timespec.h' => 1,
                         'time.h' => 1,
                         'types.h' => 1,
                         'unistd.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'librpiplc.so.4.1.0',
          'LibraryVersion' => '4',

                                                   'ltc2309_read' => 1,
                                                   'mcp23008_deinit' => 1,
                                                   'mcp23008_init' => 1,
                                                   'mcp23008_read' => 1,
                                                   'mcp23008_read_all' => 1,
                                                   'mcp23008_set_pin_mode' => 1,
                                                   'mcp23008_set_pin_mode_all' => 1,
                                                   'mcp23008_write' => 1,
                                                   'mcp23008_write_all' => 1,
                                                   'mcp23017_deinit' => 1,
                                                   'mcp23017_init' => 1,
                                                   'mcp23017_read' => 1,
                                                   'mcp23017_read_all' => 1,
                                                   'mcp23017_set_pin_mode' => 1,
                                                   'mcp23017_set_pin_mode_all' => 1,
                                                   'mcp23017_write' => 1,
                                                   'mcp23017_write_all' => 1,
                                                   'normal_gpio_analog_read' => 1,
                                                   'normal_gpio_deinit' => 1,
                                                   'normal_gpio_init' => 1,
                                                   'normal_gpio_pwm_frequency' => 1,
                                                   'normal_gpio_pwm_write' => 1,
                                                   'normal_gpio_read' => 1,
                                                   'normal_gpio_set_pin_mode' => 1,
                                                   'normal_gpio_write' => 1,
                                                   'pca9685_deinit' => 1,
                                                   'pca9685_init' => 1,
                                                   'pca9685_pwm_frequency' => 1,
                                                   'pca9685_pwm_write' => 1,
                                                   'pca9685_pwm_write_all' => 1,
                                                   'pca9685_write' => 1,
                                                   'pca9685_write_all' => 1,
                                                   'pinMode' => 1,
                                                   'rpi_gpio_deinit' => 1,
                                                   'rpi_gpio_init' => 1,
                                                   'rpi_gpio_read' => 1,
                                                   'rpi_gpio_set_pin_mode' => 1,
                                                   'rpi_gpio_write' => 1
                                                 }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '103' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '110' => {
                                     'BaseType' => '103',
                                     'Name' => 'int const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '115' => {
                                     'BaseType' => '51',
                                     'Header' => 'types.h',
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '127' => {
                                     'Name' => 'long long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '134' => {
                                     'BaseType' => '146',
                                     'Header' => 'types.h',
                                     'Line' => '48',
                                     'Name' => '__uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '146' => {
                                     'Name' => 'unsigned long long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '153' => {
                                     'Name' => 'long',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '160' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '4',
                                     'Type' => 'Pointer'
                                   },
                          '162' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '169' => {
                                     'BaseType' => '72',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '181' => {
                                     'BaseType' => '169',
                                     'Name' => 'uint8_t const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '186' => {
                                     'BaseType' => '91',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '25',
                                     'Name' => 'uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '19222' => {
                                       'BaseType' => '186',
                                       'Name' => 'uint16_t const',
                                       'Size' => '2',
                                       'Type' => 'Const'
                                     },
                          '19565' => {
                                       'BaseType' => '19222',
                                       'Name' => 'uint16_t const*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '19571' => {
                                       'BaseType' => '169',
                                       'Name' => 'uint8_t[65]',
                                       'Size' => '65',
                                       'Type' => 'Array'
                                     },
                          '198' => {
                                     'BaseType' => '115',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '210' => {
                                     'BaseType' => '134',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '27',
                                     'Name' => 'uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '22138' => {
                                       'BaseType' => '169',
                                       'Name' => 'uint8_t[5]',
                                       'Size' => '5',
                                       'Type' => 'Array'
                                     },
                          '222' => {
                                     'BaseType' => '51',
                                     'Header' => 'stddef.h',
                                     'Line' => '209',
                                     'Name' => 'size_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '22464' => {
                                       'BaseType' => '22477',
                                       'Name' => 'char const*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '22477' => {
                                       'BaseType' => '162',
                                       'Name' => 'char const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '22732' => {
                                       'BaseType' => '127',
                                       'Header' => 'types.h',
                                       'Line' => '47',
                                       'Name' => '__int64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22758' => {
                                       'BaseType' => '153',
                                       'Header' => 'types.h',
                                       'Line' => '152',
                                       'Name' => '__off_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '22777' => {
                                       'BaseType' => '22732',
                                       'Header' => 'types.h',
                                       'Line' => '153',
                                       'Name' => '__off64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22791' => {
                                       'BaseType' => '162',
                                       'Name' => 'char*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '22833' => {
                                       'BaseType' => '103',
                                       'Header' => 'int-ll64.h',
                                       'Line' => '26',
                                       'Name' => '__s32',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '22857' => {
                                       'BaseType' => '146',
                                       'Header' => 'int-ll64.h',
                                       'Line' => '31',
                                       'Name' => '__u64',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22885' => {
                                       'Header' => 'gpio.h',
                                       'Line' => '69',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'GPIO_V2_LINE_FLAG_USED',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'GPIO_V2_LINE_FLAG_ACTIVE_LOW',
                                                            'value' => '2'
                                                          },
                                                   '10' => {
                                                             'name' => 'GPIO_V2_LINE_FLAG_BIAS_DISABLED',
                                                             'value' => '1024'
                                                           },
                                                   '2' => {
                                                            'name' => 'GPIO_V2_LINE_FLAG_INPUT',
                                                            'value' => '4'
                                                          },
                                                   '3' => {
                                                            'name' => 'GPIO_V2_LINE_FLAG_OUTPUT',
                                                            'value' => '8'
                                                          },
                                                   '4' => {
                                                            'name' => 'GPIO_V2_LINE_FLAG_EDGE_RISING',
                                                            'value' => '16'
                                                          },
                                                   '5' => {
                                                            'name' => 'GPIO_V2_LINE_FLAG_EDGE_FALLING',
                                                            'value' => '32'
                                                          },
                                                   '6' => {
                                                            'name' => 'GPIO_V2_LINE_FLAG_OPEN_DRAIN',
                                                            'value' => '64'
                                                          },
                                                   '7' => {
                                                            'name' => 'GPIO_V2_LINE_FLAG_OPEN_SOURCE',
                                                            'value' => '128'
                                                          },
                                                   '8' => {
                                                            'name' => 'GPIO_V2_LINE_FLAG_BIAS_PULL_UP',
                                                            'value' => '256'
                                                          },
                                                   '9' => {
                                                            'name' => 'GPIO_V2_LINE_FLAG_BIAS_PULL_DOWN',
                                                            'value' => '512'
                                                          }
                                                 },
                                       'Name' => 'enum gpio_v2_line_flag',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '22973' => {
                                       'Header' => 'gpio.h',
                                       'Line' => '91',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bits',
                                                            'offset' => '0',
                                                            'type' => '22857'
                                                          },
                                                   '1' => {
                                                            'name' => 'mask',
                                                            'offset' => '8',
                                                            'type' => '22857'
                                                          }
                                                 },
                                       'Name' => 'struct gpio_v2_line_values',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '23016' => {
                                       'Header' => 'gpio.h',
                                       'Line' => '128',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'flags',
                                                            'offset' => '0',
                                                            'type' => '22857'
                                                          },
                                                   '1' => {
                                                            'name' => 'values',
                                                            'offset' => '0',
                                                            'type' => '22857'
                                                          },
                                                   '2' => {
                                                            'name' => 'debounce_period_us',
                                                            'offset' => '0',
                                                            'type' => '4369'
                                                          }
                                                 },
                                       'Name' => 'anon-union-gpio.h-128',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '23064' => {
                                       'Header' => 'gpio.h',
                                       'Line' => '125',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'id',
                                                            'offset' => '0',
                                                            'type' => '4369'
                                                          },
                                                   '1' => {
                                                            'name' => 'padding',
                                                            'offset' => '4',
                                                            'type' => '4369'
                                                          },
                                                   '2' => {
                                                            'name' => 'unnamed0',
                                                            'offset' => '8',
                                                            'type' => '23016'
                                                          }
                                                 },
                                       'Name' => 'struct gpio_v2_line_attribute',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '23109' => {
                                       'Header' => 'gpio.h',
                                       'Line' => '143',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'attr',
                                                            'offset' => '0',
                                                            'type' => '23064'
                                                          },
                                                   '1' => {
                                                            'name' => 'mask',
                                                            'offset' => '22',
                                                            'type' => '22857'
                                                          }
                                                 },
                                       'Name' => 'struct gpio_v2_line_config_attribute',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '23151' => {
                                       'Header' => 'gpio.h',
                                       'Line' => '162',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'flags',
                                                            'offset' => '0',
                                                            'type' => '22857'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_attrs',
                                                            'offset' => '8',
                                                            'type' => '4369'
                                                          },
                                                   '2' => {
                                                            'name' => 'padding',
                                                            'offset' => '18',
                                                            'type' => '23221'
                                                          },
                                                   '3' => {
                                                            'name' => 'attrs',
                                                            'offset' => '50',
                                                            'type' => '23237'
                                                          }
                                                 },
                                       'Name' => 'struct gpio_v2_line_config',
                                       'Size' => '272',
                                       'Type' => 'Struct'
                                     },
                          '23221' => {
                                       'BaseType' => '4369',
                                       'Name' => '__u32[5]',
                                       'Size' => '20',
                                       'Type' => 'Array'
                                     },
                          '23237' => {
                                       'BaseType' => '23109',
                                       'Name' => 'struct gpio_v2_line_config_attribute[10]',
                                       'Size' => '240',
                                       'Type' => 'Array'
                                     },
                          '23254' => {
                                       'Header' => 'gpio.h',
                                       'Line' => '191',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'offsets',
                                                            'offset' => '0',
                                                            'type' => '23367'
                                                          },
                                                   '1' => {
                                                            'name' => 'consumer',
                                                            'offset' => '598',
                                                            'type' => '4173'
                                                          },
                                                   '2' => {
                                                            'name' => 'config',
                                                            'offset' => '648',
                                                            'type' => '23151'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_lines',
                                                            'offset' => '1376',
                                                            'type' => '4369'
                                                          },
                                                   '4' => {
                                                            'name' => 'event_buffer_size',
                                                            'offset' => '1380',
                                                            'type' => '4369'
                                                          },
                                                   '5' => {
                                                            'name' => 'padding',
                                                            'offset' => '1384',
                                                            'type' => '23221'
                                                          },
                                                   '6' => {
                                                            'name' => 'fd',
                                                            'offset' => '1416',
                                                            'type' => '22833'
                                                          }
                                                 },
                                       'Name' => 'struct gpio_v2_line_request',
                                       'Size' => '592',
                                       'Type' => 'Struct'
                                     },
                          '23367' => {
                                       'BaseType' => '4369',
                                       'Name' => '__u32[64]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '23395' => {
                                       'Header' => 'struct_FILE.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_flags',
                                                            'offset' => '0',
                                                            'type' => '103'
                                                          },
                                                   '1' => {
                                                            'name' => '_IO_read_ptr',
                                                            'offset' => '4',
                                                            'type' => '22791'
                                                          },
                                                   '10' => {
                                                             'name' => '_IO_backup_base',
                                                             'offset' => '64',
                                                             'type' => '22791'
                                                           },
                                                   '11' => {
                                                             'name' => '_IO_save_end',
                                                             'offset' => '68',
                                                             'type' => '22791'
                                                           },
                                                   '12' => {
                                                             'name' => '_markers',
                                                             'offset' => '72',
                                                             'type' => '23811'
                                                           },
                                                   '13' => {
                                                             'name' => '_chain',
                                                             'offset' => '82',
                                                             'type' => '23817'
                                                           },
                                                   '14' => {
                                                             'name' => '_fileno',
                                                             'offset' => '86',
                                                             'type' => '103'
                                                           },
                                                   '15' => {
                                                             'name' => '_flags2',
                                                             'offset' => '96',
                                                             'type' => '103'
                                                           },
                                                   '16' => {
                                                             'name' => '_old_offset',
                                                             'offset' => '100',
                                                             'type' => '22758'
                                                           },
                                                   '17' => {
                                                             'name' => '_cur_column',
                                                             'offset' => '104',
                                                             'type' => '44'
                                                           },
                                                   '18' => {
                                                             'name' => '_vtable_offset',
                                                             'offset' => '112',
                                                             'type' => '65'
                                                           },
                                                   '19' => {
                                                             'name' => '_shortbuf',
                                                             'offset' => '113',
                                                             'type' => '23823'
                                                           },
                                                   '2' => {
                                                            'name' => '_IO_read_end',
                                                            'offset' => '8',
                                                            'type' => '22791'
                                                          },
                                                   '20' => {
                                                             'name' => '_lock',
                                                             'offset' => '114',
                                                             'type' => '23839'
                                                           },
                                                   '21' => {
                                                             'name' => '_offset',
                                                             'offset' => '128',
                                                             'type' => '22777'
                                                           },
                                                   '22' => {
                                                             'name' => '_codecvt',
                                                             'offset' => '136',
                                                             'type' => '23850'
                                                           },
                                                   '23' => {
                                                             'name' => '_wide_data',
                                                             'offset' => '146',
                                                             'type' => '23861'
                                                           },
                                                   '24' => {
                                                             'name' => '_freeres_list',
                                                             'offset' => '150',
                                                             'type' => '23817'
                                                           },
                                                   '25' => {
                                                             'name' => '_freeres_buf',
                                                             'offset' => '256',
                                                             'type' => '160'
                                                           },
                                                   '26' => {
                                                             'name' => '__pad5',
                                                             'offset' => '260',
                                                             'type' => '222'
                                                           },
                                                   '27' => {
                                                             'name' => '_mode',
                                                             'offset' => '264',
                                                             'type' => '103'
                                                           },
                                                   '28' => {
                                                             'name' => '_unused2',
                                                             'offset' => '274',
                                                             'type' => '23867'
                                                           },
                                                   '3' => {
                                                            'name' => '_IO_read_base',
                                                            'offset' => '18',
                                                            'type' => '22791'
                                                          },
                                                   '4' => {
                                                            'name' => '_IO_write_base',
                                                            'offset' => '22',
                                                            'type' => '22791'
                                                          },
                                                   '5' => {
                                                            'name' => '_IO_write_ptr',
                                                            'offset' => '32',
                                                            'type' => '22791'
                                                          },
                                                   '6' => {
                                                            'name' => '_IO_write_end',
                                                            'offset' => '36',
                                                            'type' => '22791'
                                                          },
                                                   '7' => {
                                                            'name' => '_IO_buf_base',
                                                            'offset' => '40',
                                                            'type' => '22791'
                                                          },
                                                   '8' => {
                                                            'name' => '_IO_buf_end',
                                                            'offset' => '50',
                                                            'type' => '22791'
                                                          },
                                                   '9' => {
                                                            'name' => '_IO_save_base',
                                                            'offset' => '54',
                                                            'type' => '22791'
                                                          }
                                                 },
                                       'Name' => 'struct _IO_FILE',
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '234' => {
                                     'Name' => 'long double',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '23786' => {
                                       'BaseType' => '23395',
                                       'Header' => 'FILE.h',
                                       'Line' => '7',
                                       'Name' => 'FILE',
                                       'Size' => '152',
                                       'Type' => 'Typedef'
                                     },
                          '23798' => {
                                       'BaseType' => '1',
                                       'Header' => 'struct_FILE.h',
                                       'Line' => '43',
                                       'Name' => '_IO_lock_t',
                                       'Type' => 'Typedef'
                                     },
                          '23806' => {
                                       'Name' => 'struct _IO_marker',
                                       'Type' => 'Struct'
                                     },
                          '23811' => {
                                       'BaseType' => '23806',
                                       'Name' => 'struct _IO_marker*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '23817' => {
                                       'BaseType' => '23395',
                                       'Name' => 'struct _IO_FILE*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '23823' => {
                                       'BaseType' => '162',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '23839' => {
                                       'BaseType' => '23798',
                                       'Name' => '_IO_lock_t*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '23845' => {
                                       'Name' => 'struct _IO_codecvt',
                                       'Type' => 'Struct'
                                     },
                          '23850' => {
                                       'BaseType' => '23845',
                                       'Name' => 'struct _IO_codecvt*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '23856' => {
                                       'Name' => 'struct _IO_wide_data',
                                       'Type' => 'Struct'
                                     },
                          '23861' => {
                                       'BaseType' => '23856',
                                       'Name' => 'struct _IO_wide_data*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '23867' => {
                                       'BaseType' => '162',
                                       'Name' => 'char[40]',
                                       'Size' => '40',
                                       'Type' => 'Array'
                                     },
                          '23883' => {
                                       'BaseType' => '23786',
                                       'Name' => 'FILE*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '23895' => {
                                       'BaseType' => '110',
                                       'Name' => 'int const*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '23901' => {
                                       'BaseType' => '103',
                                       'Name' => 'int[64]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '23986' => {
                                       'Line' => '39',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'rpi_4',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'rpi_5',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'no_rpi',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum rpi_type_t',
                                       'Size' => '4',
                                       'Source' => 'rpi-gpio.c',
                                       'Type' => 'Enum'
                                     },
                          '241' => {
                                     'Header' => 'expanded-gpio.h',
                                     'Line' => '57',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'PLC_DIRECT',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'PLC_PCA9685',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'PLC_MCP23008',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'PLC_MCP23017',
                                                          'value' => '3'
                                                        },
                                                 '4' => {
                                                          'name' => 'PLC_LTC2309',
                                                          'value' => '4'
                                                        },
                                                 '5' => {
                                                          'name' => 'PLC_ADS1015',
                                                          'value' => '5'
                                                        }
                                               },
                                     'Name' => 'anon-enum-expanded-gpio.h-57',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '24567' => {
                                       'BaseType' => '103',
                                       'Name' => 'int*',
                                       'Size' => '4',
                                       'Type' => 'Pointer'
                                     },
                          '24987' => {
                                       'BaseType' => '162',
                                       'Name' => 'char[128]',
                                       'Size' => '128',
                                       'Type' => 'Array'
                                     },
                          '25269' => {
                                       'BaseType' => '153',
                                       'Header' => 'types.h',
                                       'Line' => '160',
                                       'Name' => '__time_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '25281' => {
                                       'BaseType' => '153',
                                       'Header' => 'types.h',
                                       'Line' => '196',
                                       'Name' => '__syscall_slong_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '25346' => {
                                       'Header' => 'struct_timespec.h',
                                       'Line' => '10',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tv_sec',
                                                            'offset' => '0',
                                                            'type' => '25269'
                                                          },
                                                   '1' => {
                                                            'name' => 'tv_nsec',
                                                            'offset' => '4',
                                                            'type' => '25281'
                                                          }
                                                 },
                                       'Name' => 'struct timespec',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '292' => {
                                     'Header' => 'expanded-gpio.h',
                                     'Line' => '66',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'arrayMCP23008',
                                                          'offset' => '0',
                                                          'type' => '436'
                                                        },
                                                 '1' => {
                                                          'name' => 'numArrayMCP23008',
                                                          'offset' => '4',
                                                          'type' => '222'
                                                        },
                                                 '2' => {
                                                          'name' => 'arrayADS1015',
                                                          'offset' => '8',
                                                          'type' => '436'
                                                        },
                                                 '3' => {
                                                          'name' => 'numArrayADS1015',
                                                          'offset' => '18',
                                                          'type' => '222'
                                                        },
                                                 '4' => {
                                                          'name' => 'arrayPCA9685',
                                                          'offset' => '22',
                                                          'type' => '436'
                                                        },
                                                 '5' => {
                                                          'name' => 'numArrayPCA9685',
                                                          'offset' => '32',
                                                          'type' => '222'
                                                        },
                                                 '6' => {
                                                          'name' => 'arrayLTC2309',
                                                          'offset' => '36',
                                                          'type' => '436'
                                                        },
                                                 '7' => {
                                                          'name' => 'numArrayLTC2309',
                                                          'offset' => '40',
                                                          'type' => '222'
                                                        },
                                                 '8' => {
                                                          'name' => 'arrayMCP23017',
                                                          'offset' => '50',
                                                          'type' => '436'
                                                        },
                                                 '9' => {
                                                          'name' => 'numArrayMCP23017',
                                                          'offset' => '54',
                                                          'type' => '222'
                                                        }
                                               },
                                     'Name' => 'struct peripherals_t',
                                     'Size' => '40',
                                     'Type' => 'Struct'
                                   },
                          '3307' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '3486' => {
                                      'Name' => 'int(i2c_interface_t*, uint8_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '745'
                                                          },
                                                   '1' => {
                                                            'type' => '169'
                                                          }
                                                 },
                                      'Return' => '103',
                                      'Type' => 'Func'
                                    },
                          '3506' => {
                                      'Name' => 'int(*)(i2c_interface_t*, uint8_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '745'
                                                          },
                                                   '1' => {
                                                            'type' => '169'
                                                          }
                                                 },
                                      'Return' => '103',
                                      'Size' => '4',
                                      'Type' => 'FuncPtr'
                                    },
                          '37' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '4173' => {
                                      'BaseType' => '162',
                                      'Name' => 'char[32]',
                                      'Size' => '32',
                                      'Type' => 'Array'
                                    },
                          '4269' => {
                                      'Header' => 'i2c-interface.h',
                                      'Line' => '66',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'buff',
                                                           'offset' => '0',
                                                           'type' => '436'
                                                         },
                                                  '1' => {
                                                           'name' => 'len',
                                                           'offset' => '4',
                                                           'type' => '222'
                                                         }
                                                },
                                      'Name' => 'struct i2c_write_t',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '4281' => {
                                      'BaseType' => '4269',
                                      'Name' => 'i2c_write_t const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '4322' => {
                                      'BaseType' => '169',
                                      'Name' => 'uint8_t*',
                                      'Size' => '4',
                                      'Type' => 'Pointer'
                                    },
                          '4328' => {
                                      'Header' => 'i2c-interface.h',
                                      'Line' => '78',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'buff',
                                                           'offset' => '0',
                                                           'type' => '4322'
                                                         },
                                                  '1' => {
                                                           'name' => 'len',
                                                           'offset' => '4',
                                                           'type' => '222'
                                                         }
                                                },
                                      'Name' => 'struct i2c_read_t',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '4340' => {
                                      'BaseType' => '4328',
                                      'Name' => 'i2c_read_t const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '4345' => {
                                      'BaseType' => '37',
                                      'Header' => 'int-ll64.h',
                                      'Line' => '21',
                                      'Name' => '__u8',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '4357' => {
                                      'BaseType' => '44',
                                      'Header' => 'int-ll64.h',
                                      'Line' => '24',
                                      'Name' => '__u16',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '436' => {
                                     'BaseType' => '181',
                                     'Name' => 'uint8_t const*',
                                     'Size' => '4',
                                     'Type' => 'Pointer'
                                   },
                          '4369' => {
                                      'BaseType' => '51',
                                      'Header' => 'int-ll64.h',
                                      'Line' => '27',
                                      'Name' => '__u32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '4381' => {
                                      'Header' => 'i2c-dev.h',
                                      'Line' => '65',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'msgs',
                                                           'offset' => '0',
                                                           'type' => '4497'
                                                         },
                                                  '1' => {
                                                           'name' => 'nmsgs',
                                                           'offset' => '4',
                                                           'type' => '4369'
                                                         }
                                                },
                                      'Name' => 'struct i2c_rdwr_ioctl_data',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '44' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '4421' => {
                                      'BaseType' => '4381',
                                      'Name' => 'struct i2c_rdwr_ioctl_data const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '4426' => {
                                      'Header' => 'i2c.h',
                                      'Line' => '69',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'addr',
                                                           'offset' => '0',
                                                           'type' => '4357'
                                                         },
                                                  '1' => {
                                                           'name' => 'flags',
                                                           'offset' => '2',
                                                           'type' => '4357'
                                                         },
                                                  '2' => {
                                                           'name' => 'len',
                                                           'offset' => '4',
                                                           'type' => '4357'
                                                         },
                                                  '3' => {
                                                           'name' => 'buf',
                                                           'offset' => '8',
                                                           'type' => '4503'
                                                         }
                                                },
                                      'Name' => 'struct i2c_msg',
                                      'Size' => '12',
                                      'Type' => 'Struct'
                                    },
                          '4492' => {
                                      'BaseType' => '4426',
                                      'Name' => 'struct i2c_msg const',
                                      'Size' => '12',
                                      'Type' => 'Const'
                                    },
                          '4497' => {
                                      'BaseType' => '4426',
                                      'Name' => 'struct i2c_msg*',
                                      'Size' => '4',
                                      'Type' => 'Pointer'
                                    },
                          '4503' => {
                                      'BaseType' => '4345',
                                      'Name' => '__u8*',
                                      'Size' => '4',
                                      'Type' => 'Pointer'
                                    },
                          '490' => {
                                     'Header' => 'expanded-gpio.h',
                                     'Line' => '147',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'I2C_ALREADY_INITIALIZED',
                                                          'value' => '1'
                                                        },
                                                 '1' => {
                                                          'name' => 'I2C_ALREADY_DEINITIALIZED',
                                                          'value' => '2'
                                                        },
                                                 '10' => {
                                                           'name' => 'ARRAY_ADS1015_DEINIT_FAIL',
                                                           'value' => '11'
                                                         },
                                                 '11' => {
                                                           'name' => 'ARRAY_MCP23008_DEINIT_FAIL',
                                                           'value' => '12'
                                                         },
                                                 '12' => {
                                                           'name' => 'ARRAY_LTC2309_DEINIT_FAIL',
                                                           'value' => '13'
                                                         },
                                                 '13' => {
                                                           'name' => 'ARRAY_MCP23017_DEINIT_FAIL',
                                                           'value' => '14'
                                                         },
                                                 '14' => {
                                                           'name' => 'PLC_PERIHPERALS_STRUCT_INVALID',
                                                           'value' => '33'
                                                         },
                                                 '15' => {
                                                           'name' => 'NORMAL_GPIO_SET_PIN_MODE_FAIL',
                                                           'value' => '15'
                                                         },
                                                 '16' => {
                                                           'name' => 'ARRAY_MCP23008_SET_PIN_MODE_FAIL',
                                                           'value' => '16'
                                                         },
                                                 '17' => {
                                                           'name' => 'ARRAY_MCP23017_SET_PIN_MODE_FAIL',
                                                           'value' => '17'
                                                         },
                                                 '18' => {
                                                           'name' => 'NORMAL_GPIO_WRITE_FAIL',
                                                           'value' => '18'
                                                         },
                                                 '19' => {
                                                           'name' => 'ARRAY_PCA9685_WRITE_FAIL',
                                                           'value' => '19'
                                                         },
                                                 '2' => {
                                                          'name' => 'NORMAL_GPIO_INIT_FAIL',
                                                          'value' => '3'
                                                        },
                                                 '20' => {
                                                           'name' => 'ARRAY_MCP23008_WRITE_FAIL',
                                                           'value' => '20'
                                                         },
                                                 '21' => {
                                                           'name' => 'ARRAY_MCP23017_WRITE_FAIL',
                                                           'value' => '21'
                                                         },
                                                 '22' => {
                                                           'name' => 'NORMAL_GPIO_PWM_WRITE_FAIL',
                                                           'value' => '22'
                                                         },
                                                 '23' => {
                                                           'name' => 'ARRAY_PCA9685_PWM_WRITE_FAIL',
                                                           'value' => '23'
                                                         },
                                                 '24' => {
                                                           'name' => 'NORMAL_GPIO_PWM_CHANGE_FREQ_FAIL',
                                                           'value' => '24'
                                                         },
                                                 '25' => {
                                                           'name' => 'ARRAY_PCA9685_PWM_CHANGE_FREQ_FAIL',
                                                           'value' => '25'
                                                         },
                                                 '26' => {
                                                           'name' => 'ARRAY_PCA9685_WRITE_ALL_FAIL',
                                                           'value' => '26'
                                                         },
                                                 '27' => {
                                                           'name' => 'ARRAY_MCP23008_WRITE_ALL_FAIL',
                                                           'value' => '27'
                                                         },
                                                 '28' => {
                                                           'name' => 'ARRAY_MCP23017_WRITE_ALL_FAIL',
                                                           'value' => '28'
                                                         },
                                                 '29' => {
                                                           'name' => 'ARRAY_MCP23008_READ_ALL_FAIL',
                                                           'value' => '29'
                                                         },
                                                 '3' => {
                                                          'name' => 'ARRAY_PCA9685_INIT_FAIL',
                                                          'value' => '4'
                                                        },
                                                 '30' => {
                                                           'name' => 'ARRAY_MCP23017_READ_ALL_FAIL',
                                                           'value' => '30'
                                                         },
                                                 '31' => {
                                                           'name' => 'ARRAY_PCA9685_PWM_WRITE_ALL_FAIL',
                                                           'value' => '31'
                                                         },
                                                 '32' => {
                                                           'name' => 'I2C_PIN_WITHOUT_I2C_BUS',
                                                           'value' => '32'
                                                         },
                                                 '4' => {
                                                          'name' => 'ARRAY_ADS1015_INIT_FAIL',
                                                          'value' => '5'
                                                        },
                                                 '5' => {
                                                          'name' => 'ARRAY_MCP23008_INIT_FAIL',
                                                          'value' => '6'
                                                        },
                                                 '6' => {
                                                          'name' => 'ARRAY_LTC2309_INIT_FAIL',
                                                          'value' => '7'
                                                        },
                                                 '7' => {
                                                          'name' => 'ARRAY_MCP23017_INIT_FAIL',
                                                          'value' => '8'
                                                        },
                                                 '8' => {
                                                          'name' => 'NORMAL_GPIO_DEINIT_FAIL',
                                                          'value' => '9'
                                                        },
                                                 '9' => {
                                                          'name' => 'ARRAY_PCA9685_DEINIT_FAIL',
                                                          'value' => '10'
                                                        }
                                               },
                                     'Name' => 'anon-enum-expanded-gpio.h-147',
                                     'Size' => '4',
                                     'Type' => 'Enum'
                                   },
                          '4915' => {
                                      'BaseType' => '4281',
                                      'Name' => 'i2c_write_t const*',
                                      'Size' => '4',
                                      'Type' => 'Pointer'
                                    },
                          '4921' => {
                                      'BaseType' => '4340',
                                      'Name' => 'i2c_read_t const*',
                                      'Size' => '4',
                                      'Type' => 'Pointer'
                                    },
                          '5063' => {
                                      'BaseType' => '4426',
                                      'Name' => 'struct i2c_msg[2]',
                                      'Size' => '24',
                                      'Type' => 'Array'
                                    },
                          '5079' => {
                                      'BaseType' => '4421',
                                      'Name' => 'struct i2c_rdwr_ioctl_data const[1]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '5095' => {
                                      'BaseType' => '5079',
                                      'Name' => 'struct i2c_rdwr_ioctl_data const[1] const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '51' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '5547' => {
                                      'BaseType' => '4426',
                                      'Name' => 'struct i2c_msg[1]',
                                      'Size' => '12',
                                      'Type' => 'Array'
                                    },
                          '58' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '6221' => {
                                      'BaseType' => '745',
                                      'Name' => 'i2c_interface_t**',
                                      'Size' => '4',
                                      'Type' => 'Pointer'
                                    },
                          '65' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '6732' => {
                                      'BaseType' => '84',
                                      'Header' => 'types.h',
                                      'Line' => '39',
                                      'Name' => '__int16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '6798' => {
                                      'BaseType' => '6732',
                                      'Header' => 'stdint-intn.h',
                                      'Line' => '25',
                                      'Name' => 'int16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '703' => {
                                     'BaseType' => '709',
                                     'Name' => 'void const*',
                                     'Size' => '4',
                                     'Type' => 'Pointer'
                                   },
                          '709' => {
                                     'BaseType' => '1',
                                     'Name' => 'void const',
                                     'Type' => 'Const'
                                   },
                          '710' => {
                                     'BaseType' => '722',
                                     'Header' => 'i2c-interface.h',
                                     'Line' => '54',
                                     'Name' => 'i2c_interface_t',
                                     'Type' => 'Typedef'
                                   },
                          '7170' => {
                                      'BaseType' => '186',
                                      'Name' => 'uint16_t*',
                                      'Size' => '4',
                                      'Type' => 'Pointer'
                                    },
                          '72' => {
                                    'BaseType' => '37',
                                    'Header' => 'types.h',
                                    'Line' => '38',
                                    'Name' => '__uint8_t',
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '722' => {
                                     'Line' => '35',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'fd',
                                                          'offset' => '0',
                                                          'type' => '103'
                                                        }
                                               },
                                     'Name' => 'struct _i2c_interface_t',
                                     'Size' => '4',
                                     'Source' => 'i2c-interface.c',
                                     'Type' => 'Struct'
                                   },
                          '745' => {
                                     'BaseType' => '710',
                                     'Name' => 'i2c_interface_t*',
                                     'Size' => '4',
                                     'Type' => 'Pointer'
                                   },
                          '7521' => {
                                      'BaseType' => '6798',
                                      'Name' => 'int16_t*',
                                      'Size' => '4',
                                      'Type' => 'Pointer'
                                    },
                          '7527' => {
                                      'BaseType' => '169',
                                      'Name' => 'uint8_t[3]',
                                      'Size' => '3',
                                      'Type' => 'Array'
                                    },
                          '790' => {
                                     'Line' => '86',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'INIT_SUCCESS',
                                                          'value' => '0'
                                                        },
                                                 '1' => {
                                                          'name' => 'FIRST_INIT',
                                                          'value' => '1'
                                                        },
                                                 '2' => {
                                                          'name' => 'RESTART_DEINIT',
                                                          'value' => '2'
                                                        },
                                                 '3' => {
                                                          'name' => 'RESTART_INIT',
                                                          'value' => '3'
                                                        }
                                               },
                                     'Name' => 'enum init_fail_type_t',
                                     'Size' => '4',
                                     'Source' => 'expanded-gpio.c',
                                     'Type' => 'Enum'
                                   },
                          '84' => {
                                    'Name' => 'short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '8445' => {
                                      'BaseType' => '169',
                                      'Name' => 'uint8_t[2]',
                                      'Size' => '2',
                                      'Type' => 'Array'
                                    },
                          '91' => {
                                    'BaseType' => '44',
                                    'Header' => 'types.h',
                                    'Line' => '40',
                                    'Name' => '__uint16_t',
                                    'Size' => '2',
                                    'Type' => 'Typedef'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'librpiplc.so.4.1.0' => {
                                                            '_ITM_deregisterTMCloneTable' => 0,
                                                            '_ITM_registerTMCloneTable' => 0,
                                                            '__cxa_finalize@GLIBC_2.4' => 0,
                                                            '__errno_location@GLIBC_2.4' => 0,
                                                            '__gmon_start__' => 0,
                                                            'calloc@GLIBC_2.4' => 0,
                                                            'close@GLIBC_2.4' => 0,
                                                            'fclose@GLIBC_2.4' => 0,
                                                            'fgets@GLIBC_2.4' => 0,
                                                            'fopen@GLIBC_2.4' => 0,
                                                            'free@GLIBC_2.4' => 0,
                                                            'ioctl@GLIBC_2.4' => 0,
                                                            'malloc@GLIBC_2.4' => 0,
                                                            'memset@GLIBC_2.4' => 0,
                                                            'nanosleep@GLIBC_2.4' => 0,
                                                            'open@GLIBC_2.4' => 0,
                                                            'raise@GLIBC_2.4' => 0,
                                                            'snprintf@GLIBC_2.4' => 0,
                                                            'strstr@GLIBC_2.4' => 0,
                                                            'usleep@GLIBC_2.4' => 0
                                                          }
                                },
          'WordSize' => '4'
        };
